In [19]:
import numpy as np
a=np.array([1,2,3,4],dtype="int") # 1D array
a1=np.array([[1,2,3],[4,5,6]]) # 2D array
a2=np.array((4,5,6),ndmin=3) # tuple
a3=np.random.randint(1,10,6) #creating array without using array module 
a4=np.random.randint(15,30,16).reshape(4,-1) #creating 4x4 matrix
a4

array([[20, 23, 24, 24],
       [20, 25, 26, 22],
       [15, 19, 16, 23],
       [18, 24, 22, 19]])

### pandas
- It is one of the most important modules of data science
- Used to work with data in the form of frames/tables
- stands for paneldata
- Data analysis,manipulation and cleaning
     - Data analysis means analysing the data
       - Ex: statistics of data,volume of data etc
     - Data manipulation means transforming the data from one format to another
       - Ex: merging,concatinating etc
     - Data cleaning mens removing the null data
         1. null data means NaN(Not A Number)
- 2 Data stuctures in panda
     1) series
          - sequential data
     2) dataframe
          - data in tabular formate
- ** Installllllation**
     - pip instal pandas
     - import pandas

In [14]:
import pandas as pd

In [15]:
pd.__version__

'1.2.4'

In [16]:
st="I am from IT"
pd.Series(st)

0    I am from IT
dtype: object

In [17]:
# try with input.split()
li=input("Type your clg nme:").split()
pd.Series(li)

Type your clg nme:VR siddhartha eng clg

0            VR
1    siddhartha
2           eng
3           clg
dtype: object

In [18]:
print(pd.Series(li))

0            VR
1    siddhartha
2           eng
3           clg
dtype: object

In [20]:
# using tuple/list
t=(6,7,8,9)
t

(6, 7, 8, 9)

In [21]:
pd.Series(t)

0    6
1    7
2    8
3    9
dtype: int64

In [22]:
# usin range
pd.Series(range(10,30,6)) # 6 difference

0    10
1    16
2    22
3    28
dtype: int64

In [24]:
# using dictionary
dic={'34':"thirty four",12:90,'tuple':(9,8,'hi'),'list':[5,6,7]}
s=pd.Series(dic)
s

34       thirty four
12                90
tuple     (9, 8, hi)
list       [5, 6, 7]
dtype: object

In [25]:
s.index # getting index value

Index(['34', 12, 'tuple', 'list'], dtype='object')

In [26]:
# creating series using numpy arrays
import numpy as np
ar=np.arange(10,40,5) # array
ass=pd.Series(ar)
ass

0    10
1    15
2    20
3    25
4    30
5    35
dtype: int32

In [27]:
# modifying array index
ass.index

RangeIndex(start=0, stop=6, step=1)

In [32]:
ass.index=[4,5,6,7,8,9]
ass

4    10
5    15
6    20
7    25
8    30
9    35
dtype: int32

In [29]:
ass

0    10
1    15
2    20
3    25
4    30
5    35
dtype: int32

In [37]:
li2=[9,3,4,5,6,'hi']
inx=[num for num in range(5,11)]
pd.Series(li2,index=inx)

5      9
6      3
7      4
8      5
9      6
10    hi
dtype: object

In [72]:
# pass the user index to series created using dict
df=dic
df

{'34': 'thirty four', 12: 90, 'tuple': (9, 8, 'hi'), 'list': [5, 6, 7]}

In [39]:
len(dic)

4

In [42]:
inx=[num for num in range(10,14)]
pd.Series(dic,index=inx)

10    NaN
11    NaN
12     90
13    NaN
dtype: object

In [43]:
s

34       thirty four
12                90
tuple     (9, 8, hi)
list       [5, 6, 7]
dtype: object

In [44]:
s['tuple']

(9, 8, 'hi')

In [47]:
s.index

Index(['34', 12, 'tuple', 'list'], dtype='object')

In [54]:
s['34':]

34       thirty four
12                90
tuple     (9, 8, hi)
list       [5, 6, 7]
dtype: object

In [56]:
pd.DataFrame(dic)

            34  12 tuple  list
0  thirty four  90     9     5
1  thirty four  90     8     6
2  thirty four  90    hi     7

In [77]:
data={'int':90,'float':78.68,'str':"ruthu"}
df1=pd.DataFrame(data,index=[1,2,3,4])
df1

   int  float    str
1   90  78.68  ruthu
2   90  78.68  ruthu
3   90  78.68  ruthu
4   90  78.68  ruthu

In [78]:
df1

   int  float    str
1   90  78.68  ruthu
2   90  78.68  ruthu
3   90  78.68  ruthu
4   90  78.68  ruthu

In [83]:
# Concatination
pd.concat([df1,df2])

   int  float    str           34
1   90  78.68  ruthu          NaN
2   90  78.68  ruthu          NaN
3   90  78.68  ruthu          NaN
4   90  78.68  ruthu          NaN
1   80  79.68    NaN  thirty four
2   80  79.68    NaN  thirty four
3   80  79.68    NaN  thirty four
4   80  79.68    NaN  thirty four

In [82]:
data={'int':80,'float':79.68,"34":"thirty four"}
df2=pd.DataFrame(data,index=[1,2,3,4])
df2

   int  float           34
1   80  79.68  thirty four
2   80  79.68  thirty four
3   80  79.68  thirty four
4   80  79.68  thirty four